hasob-foundation-core-bs-5/src/Controllers/UserController.php

select * from `fc_departments` where `organization_id` = 'ff75cf4e-2d70-42f7-a5eb-ed6043d8aafd' and `fc_departments`.`deleted_at` is null
select * from `roles`
---
    public function show(Organization $org, Request $request, $id)
    {

        $edited_user = null;
        if (!empty($id)) {
            $edited_user = User::find($id);
        }

        $is_edit = ($edited_user != null);
        $departments = Department::where('organization_id', $org->id)->get();

        if ($request->expectsJson()) {
            if ($edited_user != null) {
                $edited_user->getRoleNames();
            }
            return $edited_user;
        }

        return view('hasob-foundation-core::users.edit')
                ->with("organization", $org)
                ->with("is_edit", $is_edit)
                ->with("edited_user", $edited_user)
                ->with("all_roles", Role::all())
                ->with("departments", $departments);

select `name` from `roles` where `guard_name` = 'web'
---

        $selectedRoles = [];
        $roleChangeDetected = false;
        $allRoles = Role::where('guard_name', 'web')->pluck('name');